wyp19960729/FM33L0XX-keil-GCC-/keil project/UserCode/fm33l0xx_tim.h
  uint32_t TIM_ICPrescaler;  /*!< Specifies the Input Capture Prescaler.
                                  This parameter can be a value of @ref TIM_Input_Capture_Prescaler */

  uint32_t TIM_ICFilter;     /*!< Specifies the input capture filter.
                                  This parameter can be a number between 0x0 and 0xF */
} TIM_ICInitTypeDef;
/**
* @}TIM_CR1
*/ 
  

/** @defgroup TIM_CR1_CEN
  * @{
  */
#define TIM_CR1_CEN_Pos		               						0                                             
#define TIM_CR1_CEN_Msk               				  			(0x01UL << TIM_CR1_CEN_Pos)  
#define TIM_CR1_CEN_ENABLE     				        			((uint32_t)0x00000001)
#define TIM_CR1_CEN_DISABLE    				        			((uint32_t)0x00000000) 

/** @defgroup TIM_CR1_UDIS
  * @{
  */
#define TIM_CR1_UDIS_Pos		               						1                                             
#define TIM_CR1_UDIS_Msk               				  		(0x01UL << TIM_CR1_UDIS_Pos)  
#define TIM_CR1_UDIS_DIS_UPDATE  			        			((uint32_t)0x00000002)
#define TIM_CR1_UDIS_EN_UPDATE  			        			((uint32_t)0x00000000) 

/** @defgroup TIM_CR1_URS
  * @{
  */
#define TIM_CR1_URS_Pos		       	       						2                                             
#define TIM_CR1_URS_Msk              				  			(0x01UL << TIM_CR1_URS_Pos)  
#define TIM_CR1_URS_OVER     				        				((uint32_t)0x00000004)
#define TIM_CR1_URS_ALL	    				        				((uint32_t)0x00000000) 

/** @defgroup TIM_CR1_OPM
  * @{
  */
#define TIM_CR1_OPM_Pos		       		       						3                                             
#define TIM_CR1_OPM_Msk               				  			(0x01UL << TIM_CR1_OPM_Pos)  
#define TIM_CR1_OPM_ENABLE     				        				((uint32_t)0x00000008)
#define TIM_CR1_OPM_DISABLE	   				        				((uint32_t)0x00000000) 

/** @defgroup TIM_CR1_DIR
  * @{
  */
#define TIM_CR1_DIR_Pos		               						4                                             
#define TIM_CR1_DIR_Msk               				  			(0x01UL << TIM_CR1_DIR_Pos)  
#define TIM_CR1_DIR_DOWN     				        				((uint32_t)0x00000010)
#define TIM_CR1_DIR_UP	    				        					((uint32_t)0x00000000) 

/** @defgroup TIM_CR1_CMS
  * @{
  */
#define TIM_CR1_CMS_Pos		               						5                                             
#define TIM_CR1_CMS_Msk               				  			(0x03UL << TIM_CR1_CMS_Pos)  
#define TIM_CR1_CMS_SINGLE     			        				((uint32_t)0x00000000)
#define TIM_CR1_CMS_CENTERALIGNED_DOWN 							((uint32_t)0x00000020) 
#define TIM_CR1_CMS_CENTERALIGNED_UP	       					((uint32_t)0x00000040) 
#define TIM_CR1_CMS_CENTERALIGNED_BOTH		   					((uint32_t)0x00000060) 

/** @defgroup TIM_CR1_ARPE
  * @{
  */
#define TIM_CR1_ARPE_Pos		               						7                                             
#define TIM_CR1_ARPE_Msk               				  		(0x01UL << TIM_CR1_ARPE_Pos)  
#define TIM_CR1_ARPE_PRELOAD 			        					((uint32_t)0x00000080)

/** @defgroup TIM_CR1_CKD
  * @{
  */
#define TIM_CR1_CKD_Pos		               						8                                             
#define TIM_CR1_CKD_Msk               				  			(0x03UL << TIM_CR1_CKD_Pos)  
#define TIM_CR1_CKD_1TINT     			     							((uint32_t)0x00000000)
#define TIM_CR1_CKD_2TINT		     										((uint32_t)0x00000100) 
#define TIM_CR1_CKD_4TINT	 		     									((uint32_t)0x00000200) 



/**
* @}TIM_CR2
*/ 
/** @defgroup TIM_CR2_CCPC
  * @{
  */
#define TIM_CR2_CCPC_Pos		               					0                                             
#define TIM_CR2_CCPC_Msk               							(0x01UL << TIM_CR2_CCPC_Pos)  
#define TIM_CR2_CCPC_ENABLE     				        		((uint32_t)0x00000001)
//#define TIM_CR2_CCPC_DISABLE    				        		((uint32_t)0x00000000)   
	
/** @defgroup TIM_CR2_CCUS
  * @{
  */
#define TIM_CR2_CCUS_Pos		               					2                                             
#define TIM_CR2_CCUS_Msk               							(0x01UL << TIM_CR2_CCUS_Pos)  
#define TIM_CR2_CCUS_COMNTRI     				        		((uint32_t)0x00000004)
#define TIM_CR2_CCUS_COM    				     			   		((uint32_t)0x00000000)   

/** @defgroup TIM_CR2_CCDS
  * @{
  */
#define TIM_CR2_CCDS_Pos		               					3                                             
#define TIM_CR2_CCDS_Msk               							(0x01UL << TIM_CR2_CCDS_Pos)  
#define TIM_CR2_CCDS_CCX		    				        		((uint32_t)0x00000008)
#define TIM_CR2_CCDS_UEV    				     			   		((uint32_t)0x00000000)   

/** @defgroup TIM_CR2_MMS
  * @{
  */
#define TIM_CR2_MMS_Pos		               						4                                             
#define TIM_CR2_MMS_Msk               							(0x07UL << TIM_CR2_MMS_Pos)  
#define TIM_CR2_MMS_UG		   		 				        		((uint32_t)0x00000000)
#define TIM_CR2_MMS_CEN    				     			   			((uint32_t)0x00000010)   
#define TIM_CR2_MMS_UEV    				     			   			((uint32_t)0x00000020)
#define TIM_CR2_MMS_COMP   				     			   			((uint32_t)0x00000030)
#define TIM_CR2_MMS_OC1REF  			     			   			((uint32_t)0x00000040)
#define TIM_CR2_MMS_OC2REF 				     			   			((uint32_t)0x00000050)
#define TIM_CR2_MMS_OC3REF    			   			   			((uint32_t)0x00000060)
#define TIM_CR2_MMS_OC4REF  			     			   			((uint32_t)0x00000070)

/** @defgroup TIM_CR2_T1S
  * @{
  */
#define TIM_CR2_T1S_Pos		               						7                                             
#define TIM_CR2_T1S_Msk               							(0x01UL << TIM_CR2_T1S_Pos)  
#define TIM_CR2_T1S_T123XOR    				        			((uint32_t)0x00000080)
#define TIM_CR2_T1S_T1    				     			   			((uint32_t)0x00000000) 

/** @defgroup TIM_CR2_OIS1
  * @{
  */
#define TIM_CR2_OIS1_Pos		               					8                                             
#define TIM_CR2_OIS1_Msk               							(0x01UL << TIM_CR2_OIS1_Pos)  
#define TIM_CR2_OIS1_RESET    				     					((uint32_t)0x00000000)
#define TIM_CR2_OIS1_SET   				     			   			((uint32_t)0x00000100) 

/** @defgroup TIM_CR2_OIS1N
  * @{
  */
#define TIM_CR2_OIS1N_Pos		               					9                                             
#define TIM_CR2_OIS1N_Msk               						(0x01UL << TIM_CR2_OIS1N_Pos)  
#define TIM_CR2_OIS1N_RESET  				        				((uint32_t)0x00000000)
#define TIM_CR2_OIS1N_SET   				   			   			((uint32_t)0x00000200) 

/** @defgroup TIM_CR2_OIS2
  * @{
  */
#define TIM_CR2_OIS2_Pos		               					10                                             
#define TIM_CR2_OIS2_Msk               							(0x01UL << TIM_CR2_OIS2_Pos)  
#define TIM_CR2_OIS2_RESET 				        					((uint32_t)0x00000000)
#define TIM_CR2_OIS2_SET   				     			   			((uint32_t)0x00000400) 

