wyp19960729/FM33L0XX-keil-GCC-/keil project/UserCode/fm33l0xx_tim.h
/** @defgroup TIM_CR2_OIS2N
  * @{
  */
#define TIM_CR2_OIS2N_Pos		               					11                                             
#define TIM_CR2_OIS2N_Msk               						(0x01UL << TIM_CR2_OIS2N_Pos)  
#define TIM_CR2_OIS2N_RESET  				        				((uint32_t)0x00000000)
#define TIM_CR2_OIS2N_SET  				     			   			((uint32_t)0x00000800) 

/** @defgroup TIM_CR2_OIS3
  * @{
  */
#define TIM_CR2_OIS3_Pos		               					12                                             
#define TIM_CR2_OIS3_Msk               							(0x01UL << TIM_CR2_OIS3_Pos)  
#define TIM_CR2_OIS3_RESET 				        					((uint32_t)0x00000000)
#define TIM_CR2_OIS3_SET   				     			   			((uint32_t)0x00001000) 

/** @defgroup TIM_CR2_OIS3N
  * @{
  */
#define TIM_CR2_OIS3N_Pos		               					13                                             
#define TIM_CR2_OIS3N_Msk               						(0x01UL << TIM_CR2_OIS3N_Pos)  
#define TIM_CR2_OIS3N_RESET  				        				((uint32_t)0x00000000)
#define TIM_CR2_OIS3N_SET  				     			   			((uint32_t)0x00002000) 

/** @defgroup TIM_CR2_OIS4
  * @{
  */
#define TIM_CR2_OIS4_Pos		               					14                                             
#define TIM_CR2_OIS4_Msk               							(0x01UL << TIM_CR2_OIS4_Pos)  
#define TIM_CR2_OIS4_RESET 				        					((uint32_t)0x00000000)
#define TIM_CR2_OIS4_SET   				     			   			((uint32_t)0x00004000) 


/**
* @}TIM_SMCR
*/ 	

/** @defgroup TIM_SMCR_SMS
  * @{
  */
#define TIM_SMCR_SMS_Pos		               				0                                             
#define TIM_SMCR_SMS_Msk               						(0x07UL << TIM_SMCR_SMS_Pos)  
#define TIM_SMCR_SMS_INTERNAL     				        ((uint32_t)0x00000000)
#define TIM_SMCR_SMS_ENCODER1    				        	((uint32_t)0x00000001) 
#define TIM_SMCR_SMS_ENCODER2    				        	((uint32_t)0x00000002) 	
#define TIM_SMCR_SMS_ENCODER3    				        	((uint32_t)0x00000003) 	
#define TIM_SMCR_SMS_RESET	    				        	((uint32_t)0x00000004) 	
#define TIM_SMCR_SMS_GATE		    				        	((uint32_t)0x00000005) 	
#define TIM_SMCR_SMS_TRGI		    				        	((uint32_t)0x00000006) 	
#define TIM_SMCR_SMS_EXCLK1	    				        	((uint32_t)0x00000007) 	

/** @defgroup TIM_SMCR_TS
  * @{
  */
#define TIM_SMCR_TS_Pos		               					4                                             
#define TIM_SMCR_TS_Msk               						(0x07UL << TIM_SMCR_TS_Pos)  
#define TIM_SMCR_TS_ITR0     				        			((uint32_t)0x00000000)
#define TIM_SMCR_TS_ITR1    				        			((uint32_t)0x00000010) 
#define TIM_SMCR_TS_ITR2    				     			   	((uint32_t)0x00000020) 	
#define TIM_SMCR_TS_ITR3    				    		    	((uint32_t)0x00000030) 	
#define TIM_SMCR_TS_TI1F_ED	    				        	((uint32_t)0x00000040) 	
#define TIM_SMCR_TS_TI1FP1		    				       	((uint32_t)0x00000050) 	
#define TIM_SMCR_TS_TI2FP2		    			        	((uint32_t)0x00000060) 	
#define TIM_SMCR_TS_ETRF		    				        	((uint32_t)0x00000070) 	

/** @defgroup TIM_SMCR_MSM
  * @{
  */
#define TIM_SMCR_MSM_Pos		               					7                                             
#define TIM_SMCR_MSM_Msk               						(0x01UL << TIM_SMCR_MSM_Pos)  
#define TIM_SMCR_MSM_N0NE     				        		((uint32_t)0x00000000)
#define TIM_SMCR_MSM_MSMODE  				        			((uint32_t)0x00000080) 

/** @defgroup TIM_SMCR_ETF
  * @{
  */
#define TIM_SMCR_ETF_Pos		               					8                           	
#define TIM_SMCR_ETF_Msk               							(0x0FUL << TIM_SMCR_ETF_Pos)  
#define TIM_SMCR_ETF_NONE      						        	((uint32_t)0x00000000) 
#define TIM_SMCR_ETF_FCLK_N2      				        	((uint32_t)0x00000100) 
#define TIM_SMCR_ETF_FCLK_N4     				        		((uint32_t)0x00000200) 
#define TIM_SMCR_ETF_FCLK_N8      				        	((uint32_t)0x00000300) 
#define TIM_SMCR_ETF_FDTS_DIV2N6   				        	((uint32_t)0x00000400)
#define TIM_SMCR_ETF_FDTS_DIV2N8 				        		((uint32_t)0x00000500) 
#define TIM_SMCR_ETF_FDTS_DIV4N6     		        		((uint32_t)0x00000600) 
#define TIM_SMCR_ETF_FDTS_DIV4N8 				        		((uint32_t)0x00000700) 
#define TIM_SMCR_ETF_FDTS_DIV8N6   				        	((uint32_t)0x00000800)
#define TIM_SMCR_ETF_FDTS_DIV8N8 				        		((uint32_t)0x00000900) 
#define TIM_SMCR_ETF_FDTS_DIV16N5     		        	((uint32_t)0x00000A00) 
#define TIM_SMCR_ETF_FDTS_DIV16N6 				        	((uint32_t)0x00000B00) 
#define TIM_SMCR_ETF_FDTS_DIV16N8   				       	((uint32_t)0x00000C00)
#define TIM_SMCR_ETF_FDTS_DIV32N5 				        	((uint32_t)0x00000D00) 
#define TIM_SMCR_ETF_FDTS_DIV32N6     		        	((uint32_t)0x00000E00) 
#define TIM_SMCR_ETF_FDTS_DIV32N8 				        	((uint32_t)0x00000F00) 

/** @defgroup TIM_SMCR_ETPS
  * @{
  */
#define TIM_SMCR_ETPS_Pos		               					12                                             
#define TIM_SMCR_ETPS_Msk               						(0x03UL << TIM_SMCR_ETPS_Pos)  
#define TIM_SMCR_ETPS_NONE			     				        ((uint32_t)0x00000000)
#define TIM_SMCR_ETPS_PER2      				        		((uint32_t)0x00001000) 
#define TIM_SMCR_ETPS_PER4      				        		((uint32_t)0x00002000) 
#define TIM_SMCR_ETPS_PER8      				        		((uint32_t)0x00003000)
	
/** @defgroup TIM_SMCR_ECE
  * @{
  */
#define TIM_SMCR_ECE_Pos		               					14                                             
#define TIM_SMCR_ECE_Msk               							(0x01UL << TIM_SMCR_ECE_Pos)  
#define TIM_SMCR_ECE_EXC2_DISABLE					     		  ((uint32_t)0x00000000)
#define TIM_SMCR_ECE_EXC2_ENABLE    		     		 		((uint32_t)0x00004000) 

/** @defgroup TIM_SMCR_ETP
  * @{
  */
#define TIM_SMCR_ETP_Pos		               					15                                             
#define TIM_SMCR_ETP_Msk               							(0x01UL << TIM_SMCR_ETP_Pos)  
#define TIM_SMCR_ETP_HIGH			     				   		    ((uint32_t)0x00000000)
#define TIM_SMCR_ETP_LOW      				       		 		((uint32_t)0x00008000) 

	
/**
* @}TIM_DIER
*/ 	

/** @defgroup TIM_DIER_UIE
  * @{
  */
#define TIM_DIER_UIE_Pos		               					0                                             
#define TIM_DIER_UIE_Msk               							(0x01UL << TIM_DIER_UIE_Pos)  
#define TIM_DIER_UIE     				        						((uint32_t)0x00000001)

/** @defgroup TIM_DIER_CC1IE
  * @{
  */
#define TIM_DIER_CC1IE_Pos		               				1                                             
#define TIM_DIER_CC1IE_Msk               						(0x01UL << TIM_DIER_CC1IE_Pos)  
#define TIM_DIER_CC1IE     				        					((uint32_t)0x00000002)

/** @defgroup TIM_DIER_CC2IE
  * @{
  */
#define TIM_DIER_CC2IE_Pos		               				2                                             
#define TIM_DIER_CC2IE_Msk               						(0x01UL << TIM_DIER_CC2IE_Pos)  
#define TIM_DIER_CC2IE     				        					((uint32_t)0x00000004)

