wyp19960729/FM33L0XX-keil-GCC-/keil project/UserCode/fm33l0xx_tim.h
/** @defgroup TIM_DIER_CC3IE
  * @{
  */
#define TIM_DIER_CC3IE_Pos		               				3                                             
#define TIM_DIER_CC3IE_Msk               						(0x01UL << TIM_DIER_CC3IE_Pos)  
#define TIM_DIER_CC3IE     				        					((uint32_t)0x00000008)

/** @defgroup TIM_DIER_CC4IE
  * @{
  */
#define TIM_DIER_CC4IE_Pos		               				4                                             
#define TIM_DIER_CC4IE_Msk               						(0x01UL << TIM_DIER_CC4IE_Pos)  
#define TIM_DIER_CC4IE     				        					((uint32_t)0x00000010)

/** @defgroup TIM_DIER_COMIE
  * @{
  */
#define TIM_DIER_COMIE_Pos		               				5                                             
#define TIM_DIER_COMIE_Msk               						(0x01UL << TIM_DIER_COMIE_Pos)  
#define TIM_DIER_COMIE     				        					((uint32_t)0x00000020)

/** @defgroup TIM_DIER_TIE
  * @{
  */
#define TIM_DIER_TIE_Pos		               					6                                             
#define TIM_DIER_TIE_Msk               							(0x01UL << TIM_DIER_TIE_Pos)  
#define TIM_DIER_TIE     				        						((uint32_t)0x00000040)

/** @defgroup TIM_DIER_BIE
  * @{
  */
#define TIM_DIER_BIE_Pos		               					7                                             
#define TIM_DIER_BIE_Msk               							(0x01UL << TIM_DIER_BIE_Pos)  
#define TIM_DIER_BIE     				        						((uint32_t)0x00000080)

/** @defgroup TIM_DIER_UDE
  * @{
  */
#define TIM_DIER_UDE_Pos		               					8                                             
#define TIM_DIER_UDE_Msk               							(0x01UL << TIM_DIER_UDE_Pos)  
#define TIM_DIER_UDE     				        						((uint32_t)0x00000100)

/** @defgroup TIM_DIER_CC1DE
  * @{
  */
#define TIM_DIER_CC1DE_Pos		               				9                                             
#define TIM_DIER_CC1DE_Msk               						(0x01UL << TIM_DIER_CC1DE_Pos)  
#define TIM_DIER_CC1DE     				        					((uint32_t)0x00000200)

/** @defgroup TIM_DIER_CC2DE
  * @{
  */
#define TIM_DIER_CC2DE_Pos		               				10                                             
#define TIM_DIER_CC2DE_Msk               						(0x01UL << TIM_DIER_CC2DE_Pos)  
#define TIM_DIER_CC2DE     				        					((uint32_t)0x00000400)

/** @defgroup TIM_DIER_CC3DE
  * @{
  */
#define TIM_DIER_CC3DE_Pos		               				11                                             
#define TIM_DIER_CC3DE_Msk               						(0x01UL << TIM_DIER_CC3DE_Pos)  
#define TIM_DIER_CC3DE     				        					((uint32_t)0x00000800)

/** @defgroup TIM_DIER_CC4DE
  * @{
  */
#define TIM_DIER_CC4DE_Pos		               				12                                             
#define TIM_DIER_CC4DE_Msk               						(0x01UL << TIM_DIER_CC4DE_Pos)  
#define TIM_DIER_CC4DE     				        					((uint32_t)0x00001000)

/** @defgroup TIM_DIER_COMDE
  * @{
  */
#define TIM_DIER_COMDE_Pos		               				13                                             
#define TIM_DIER_COMDE_Msk               						(0x01UL << TIM_DIER_COMDE_Pos)  
#define TIM_DIER_COMDE     				        					((uint32_t)0x00002000)

/** @defgroup TIM_DIER_TDE
  * @{
  */
#define TIM_DIER_TDE_Pos		               					14                                             
#define TIM_DIER_TDE_Msk               							(0x01UL << TIM_DIER_TDE_Pos)  
#define TIM_DIER_TDE     				        						((uint32_t)0x00004000)

/**
* @}TIM_SR
*/ 

#define TIM_SR_UIF				    				        			((uint32_t)0x00000001)
#define TIM_SR_CC1IF				    				        		((uint32_t)0x00000002)
#define TIM_SR_CC2IF				    				        		((uint32_t)0x00000004)
#define TIM_SR_CC3IF				    				        		((uint32_t)0x00000008)
#define TIM_SR_CC4IF				    				        		((uint32_t)0x00000010)
#define TIM_SR_COMIF				    				        		((uint32_t)0x00000020)
#define TIM_SR_TIF					    				        		((uint32_t)0x00000040)
#define TIM_SR_BIF				    				        			((uint32_t)0x00000080)

#define TIM_SR_CC1OF			    				        			((uint32_t)0x00000200)
#define TIM_SR_CC2OF			    				        			((uint32_t)0x00000400)
#define TIM_SR_CC3OF			    				        			((uint32_t)0x00000800)
#define TIM_SR_CC4OF			    				        			((uint32_t)0x00000100)

/**
* @}TIM_EGR
*/ 
	
#define TIM_EGR_UG     				        							((uint32_t)0x00000001)
#define TIM_EGR_CC1G   				        							((uint32_t)0x00000002)
#define TIM_EGR_CC2G     				       							((uint32_t)0x00000004)
#define TIM_EGR_CC3G   				        							((uint32_t)0x00000008)
#define TIM_EGR_CC4G   				        							((uint32_t)0x00000010)
#define TIM_EGR_COMG   				        							((uint32_t)0x00000020)
#define TIM_EGR_TG   				        								((uint32_t)0x00000040)
#define TIM_EGR_BG   				        								((uint32_t)0x00000080)





/**
* @}TIM_CCMR1
*/

/** @defgroup TIM_CCMR1_CC1S
  * @{
  */

#define TIM_CCMR1_CC1S_Pos		               					0                                             
#define TIM_CCMR1_CC1S_Msk               							(0x03UL << TIM_CCMR1_CC1S_Pos)  
#define TIM_CCMR1_CC1S_OUTPUT			     				        ((uint32_t)0x00000000)
#define TIM_CCMR1_CC1S_INPUT_TI1      				        ((uint32_t)0x00000001) 
#define TIM_CCMR1_CC1S_INPUT_TI2      				        ((uint32_t)0x00000002) 
#define TIM_CCMR1_CC1S_INPUT_TRC      				        ((uint32_t)0x00000003) 


/** @defgroup TIM_CCMR1_IC1PCS
  * @{
  */

#define TIM_CCMR1_IC1PCS_Pos		               				2                                             
#define TIM_CCMR1_IC1PCS_Msk               						(0x03UL << TIM_CCMR1_IC1PCS_Pos)  
#define TIM_CCMR1_IC1PCS_NONE			     				        ((uint32_t)0x00000000)
#define TIM_CCMR1_IC1PCS_PER2      				        		((uint32_t)0x00000004) 
#define TIM_CCMR1_IC1PCS_PER4      				        		((uint32_t)0x00000008) 
#define TIM_CCMR1_IC1PCS_PER8      				        		((uint32_t)0x0000000C) 

/** @defgroup TIM_CCMR1_IC1F
  * @{
  */

#define TIM_CCMR1_IC1F_Pos		               					4                                             
#define TIM_CCMR1_IC1F_Msk               							(0x0FUL << TIM_CCMR1_IC1F_Pos)  

#define TIM_CCMR1_IC2F_Pos		               					12                                             
#define TIM_CCMR1_IC2F_Msk               							(0x0FUL << TIM_CCMR1_IC2F_Pos)  

#define TIM_CCMR1_ICxF_NONE			     				        	((uint32_t)0x00000000)
#define TIM_CCMR1_ICxF_FCLK_N2      				        	((uint32_t)0x00000001) 
#define TIM_CCMR1_ICxF_FCLK_N4     				        		((uint32_t)0x00000002) 
#define TIM_CCMR1_ICxF_FCLK_N8      				        	((uint32_t)0x00000003) 
#define TIM_CCMR1_ICxF_FDTS_DIV2N6   				        	((uint32_t)0x00000004)
#define TIM_CCMR1_ICxF_FDTS_DIV2N8 				        		((uint32_t)0x00000005) 
#define TIM_CCMR1_ICxF_FDTS_DIV4N6     		        		((uint32_t)0x00000006) 
#define TIM_CCMR1_ICxF_FDTS_DIV4N8 				        		((uint32_t)0x00000007) 
#define TIM_CCMR1_ICxF_FDTS_DIV8N6   				        	((uint32_t)0x00000008)
#define TIM_CCMR1_ICxF_FDTS_DIV8N8 				        		((uint32_t)0x00000009) 
#define TIM_CCMR1_ICxF_FDTS_DIV16N5     		        	((uint32_t)0x0000000A) 
#define TIM_CCMR1_ICxF_FDTS_DIV16N6 				        	((uint32_t)0x0000000B) 
#define TIM_CCMR1_ICxF_FDTS_DIV16N8   				       	((uint32_t)0x0000000C)
#define TIM_CCMR1_ICxF_FDTS_DIV32N5 				        	((uint32_t)0x0000000D) 
#define TIM_CCMR1_ICxF_FDTS_DIV32N6     		        	((uint32_t)0x0000000E) 
#define TIM_CCMR1_ICxF_FDTS_DIV32N8 				        	((uint32_t)0x0000000F) 

/** @defgroup TIM_CCMR1_CC2S
  * @{
  */

#define TIM_CCMR1_CC2S_Pos		               					8                                             
#define TIM_CCMR1_CC2S_Msk               							(0x03UL << TIM_CCMR1_CC2S_Pos)  
#define TIM_CCMR1_CC2S_OUTPUT			     				        ((uint32_t)0x00000000)
#define TIM_CCMR1_CC2S_INPUT_TI2      				        ((uint32_t)0x00000100) 
#define TIM_CCMR1_CC2S_INPUT_TI1      				        ((uint32_t)0x00000200) 
#define TIM_CCMR1_CC2S_INPUT_TRC      				        ((uint32_t)0x00000300) 

