wyp19960729/FM33L0XX-keil-GCC-/keil project/UserCode/fm33l0xx_tim.h
/** @defgroup TIM_CCMR1_IC2PCS
  * @{
  */

#define TIM_CCMR1_IC2PCS_Pos		               				10                                             
#define TIM_CCMR1_IC2PCS_Msk               						(0x03UL << TIM_CCMR1_IC2PCS_Pos)  
#define TIM_CCMR1_IC2PCS_NONE			     				        ((uint32_t)0x00000000)
#define TIM_CCMR1_IC2PCS_PER2      				        		((uint32_t)0x00000400) 
#define TIM_CCMR1_IC2PCS_PER4      				        		((uint32_t)0x00000800) 
#define TIM_CCMR1_IC2PCS_PER8      				        		((uint32_t)0x00000C00) 

/** @defgroup TIM_CCMR1_OC1FE
  * @{
  */
#define TIM_CCMR1_OC1FE_Pos		               					2                                             
#define TIM_CCMR1_OC1FE_Msk               						(0x01UL << TIM_CCMR1_OC1FE_Pos)  
#define TIM_CCMR1_OC1FE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR1_OC1FE_ENABLE      				       		((uint32_t)0x00000004) 

/** @defgroup TIM_CCMR1_OC1PE
  * @{
  */
#define TIM_CCMR1_OC1PE_Pos		               					3                                             
#define TIM_CCMR1_OC1PE_Msk               						(0x01UL << TIM_CCMR1_OC1PE_Pos)  
#define TIM_CCMR1_OC1PE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR1_OC1PE_ENABLE      				       		((uint32_t)0x00000008) 

/** @defgroup TIM_CCMR1_OC1M
  * @{
  */

#define TIM_CCMR1_OC1M_Pos		               					4                                             
#define TIM_CCMR1_OC1M_Msk               							(0x07UL << TIM_CCMR1_OC1M_Pos)  
#define TIM_CCMR1_OC1M_NONE			     				       		((uint32_t)0x00000000)
#define TIM_CCMR1_OC1M_EQH			     				       		((uint32_t)0x00000010)
#define TIM_CCMR1_OC1M_EQL     				        				((uint32_t)0x00000020) 
#define TIM_CCMR1_OC1M_EQTOGGLE  				        			((uint32_t)0x00000030) 
#define TIM_CCMR1_OC1M_FL      			 	        				((uint32_t)0x00000040) 
#define TIM_CCMR1_OC1M_FH 			     				       		((uint32_t)0x00000050)
#define TIM_CCMR1_OC1M_PWM1    				        				((uint32_t)0x00000060) 
#define TIM_CCMR1_OC1M_PWM2		  				        			((uint32_t)0x00000070) 

/** @defgroup TIM_CCMR1_OC1CE
  * @{
  */
#define TIM_CCMR1_OC1CE_Pos		               					7                                             
#define TIM_CCMR1_OC1CE_Msk               						(0x01UL << TIM_CCMR1_OC1CE_Pos)  
#define TIM_CCMR1_OC1CE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR1_OC1CE_ENABLE      				       		((uint32_t)0x00000080) 	
	
/** @defgroup TIM_CCMR1_OC2FE
  * @{
  */
#define TIM_CCMR1_OC2FE_Pos		               					10                                             
#define TIM_CCMR1_OC2FE_Msk               						(0x01UL << TIM_CCMR1_OC2FE_Pos)  
#define TIM_CCMR1_OC2FE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR1_OC2FE_ENABLE      				       		((uint32_t)0x00000400) 

/** @defgroup TIM_CCMR1_OC2PE
  * @{
  */
#define TIM_CCMR1_OC2PE_Pos		               					11                                             
#define TIM_CCMR1_OC2PE_Msk               						(0x01UL << TIM_CCMR1_OC2PE_Pos)  
#define TIM_CCMR1_OC2PE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR1_OC2PE_ENABLE      				       		((uint32_t)0x00000800) 

/** @defgroup TIM_CCMR1_OC2M
  * @{
  */

#define TIM_CCMR1_OC2M_Pos		               					12                                             
#define TIM_CCMR1_OC2M_Msk               							(0x07UL << TIM_CCMR1_OC2M_Pos)  
#define TIM_CCMR1_OC2M_NONE			     				       		((uint32_t)0x00000000)
#define TIM_CCMR1_OC2M_EQH			     				       		((uint32_t)0x00001000)
#define TIM_CCMR1_OC2M_EQL     				        				((uint32_t)0x00002000) 
#define TIM_CCMR1_OC2M_EQTOGGLE  				        			((uint32_t)0x00003000) 
#define TIM_CCMR1_OC2M_FL      			 	        				((uint32_t)0x00004000) 
#define TIM_CCMR1_OC2M_FH 			     				       		((uint32_t)0x00005000)
#define TIM_CCMR1_OC2M_PWM1    				        				((uint32_t)0x00006000) 
#define TIM_CCMR1_OC2M_PWM2		  				        			((uint32_t)0x00007000) 

/** @defgroup TIM_CCMR1_OC2CE
  * @{
  */
#define TIM_CCMR1_OC2CE_Pos		               					15                                             
#define TIM_CCMR1_OC2CE_Msk               						(0x01UL << TIM_CCMR1_OC2CE_Pos)  
#define TIM_CCMR1_OC2CE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR1_OC2CE_ENABLE      				       		((uint32_t)0x00008000) 		
	

/**
* @}TIM_CCMR2
*/

/** @defgroup TIM_CCMR2_CC3S
  * @{
  */

#define TIM_CCMR2_CC3S_Pos		               					0                                             
#define TIM_CCMR2_CC3S_Msk               							(0x03UL << TIM_CCMR2_CC3S_Pos)  
#define TIM_CCMR2_CC3S_OUTPUT			     				        ((uint32_t)0x00000000)
#define TIM_CCMR2_CC3S_INPUT_TI3      				        ((uint32_t)0x00000001) 
#define TIM_CCMR2_CC3S_INPUT_TI4      				        ((uint32_t)0x00000002) 
#define TIM_CCMR2_CC3S_INPUT_TRC      				        ((uint32_t)0x00000003) 


/** @defgroup TIM_CCMR2_IC3PCS
  * @{
  */

#define TIM_CCMR2_IC3PCS_Pos		               				2                                             
#define TIM_CCMR2_IC3PCS_Msk               						(0x03UL << TIM_CCMR2_IC3PCS_Pos)  
#define TIM_CCMR2_IC3PCS_NONE			     				        ((uint32_t)0x00000000)
#define TIM_CCMR2_IC3PCS_PER2      				        		((uint32_t)0x00000004) 
#define TIM_CCMR2_IC3PCS_PER4      				        		((uint32_t)0x00000008) 
#define TIM_CCMR2_IC3PCS_PER8      				        		((uint32_t)0x0000000C) 

/** @defgroup TIM_CCMR2_IC3F
  * @{
  */

#define TIM_CCMR2_IC3F_Pos		               					4                                             
#define TIM_CCMR2_IC3F_Msk               							(0x0FUL << TIM_CCMR2_IC3F_Pos)  

#define TIM_CCMR2_IC4F_Pos		               					12                                             
#define TIM_CCMR2_IC4F_Msk               							(0x0FUL << TIM_CCMR2_IC4F_Pos)  



/** @defgroup TIM_CCMR2_CC4S
  * @{
  */

#define TIM_CCMR2_CC4S_Pos		               					8                                             
#define TIM_CCMR2_CC4S_Msk               							(0x03UL << TIM_CCMR2_CC4S_Pos)  
#define TIM_CCMR2_CC4S_OUTPUT			     				        ((uint32_t)0x00000000)
#define TIM_CCMR2_CC4S_INPUT_TI4      				        ((uint32_t)0x00000100) 
#define TIM_CCMR2_CC4S_INPUT_TI3      				        ((uint32_t)0x00000200) 
#define TIM_CCMR2_CC4S_INPUT_TRC      				        ((uint32_t)0x00000300) 

/** @defgroup TIM_CCMR2_IC4PCS
  * @{
  */

#define TIM_CCMR2_IC4PCS_Pos		               				10                                             
#define TIM_CCMR2_IC4PCS_Msk               						(0x03UL << TIM_CCMR2_IC4PCS_Pos)  
#define TIM_CCMR2_IC4PCS_NONE			     				        ((uint32_t)0x00000000)
#define TIM_CCMR2_IC4PCS_PER2      				        		((uint32_t)0x00000400) 
#define TIM_CCMR2_IC4PCS_PER4      				        		((uint32_t)0x00000800) 
#define TIM_CCMR2_IC4PCS_PER8      				        		((uint32_t)0x00000C00) 


/** @defgroup TIM_CCMR2_OC3FE
  * @{
  */
#define TIM_CCMR2_OC3FE_Pos		               					2                                             
#define TIM_CCMR2_OC3FE_Msk               						(0x01UL << TIM_CCMR2_OC3FE_Pos)  
#define TIM_CCMR2_OC3FE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR2_OC3FE_ENABLE      				       		((uint32_t)0x00000004) 

/** @defgroup TIM_CCMR2_OC3PE
  * @{
  */
#define TIM_CCMR2_OC3PE_Pos		               					3                                             
#define TIM_CCMR2_OC3PE_Msk               						(0x01UL << TIM_CCMR2_OC3PE_Pos)  
#define TIM_CCMR2_OC3PE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR2_OC3PE_ENABLE      				       		((uint32_t)0x00000008) 

/** @defgroup TIM_CCMR2_OC3M
  * @{
  */

#define TIM_CCMR2_OC3M_Pos		               					4                                             
#define TIM_CCMR2_OC3M_Msk               							(0x07UL << TIM_CCMR2_OC3M_Pos)  
#define TIM_CCMR2_OC3M_NONE			     				       		((uint32_t)0x00000000)
#define TIM_CCMR2_OC3M_EQH			     				       		((uint32_t)0x00000010)
#define TIM_CCMR2_OC3M_EQL     				        				((uint32_t)0x00000020) 
#define TIM_CCMR2_OC3M_EQTOGGLE  				        			((uint32_t)0x00000030) 
#define TIM_CCMR2_OC3M_FL      			 	        				((uint32_t)0x00000040) 
#define TIM_CCMR2_OC3M_FH 			     				       		((uint32_t)0x00000050)
#define TIM_CCMR2_OC3M_PWM1    				        				((uint32_t)0x00000060) 
#define TIM_CCMR2_OC3M_PWM2		  				        			((uint32_t)0x00000070) 

/** @defgroup TIM_CCMR2_OC3CE
  * @{
  */
#define TIM_CCMR2_OC3CE_Pos		               					7                                             
#define TIM_CCMR2_OC3CE_Msk               						(0x01UL << TIM_CCMR2_OC3CE_Pos)  
#define TIM_CCMR2_OC3CE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR2_OC3CE_ENABLE      				       		((uint32_t)0x00000080) 	
	
/** @defgroup TIM_CCMR2_OC4FE
  * @{
  */
#define TIM_CCMR2_OC4FE_Pos		               					10                                             
#define TIM_CCMR2_OC4FE_Msk               						(0x01UL << TIM_CCMR2_OC4FE_Pos)  
#define TIM_CCMR2_OC4FE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR2_OC4FE_ENABLE      				       		((uint32_t)0x00000400) 

