wyp19960729/FM33L0XX-keil-GCC-/keil project/UserCode/fm33l0xx_tim.h
/** @defgroup TIM_CCMR2_OC4PE
  * @{
  */
#define TIM_CCMR2_OC4PE_Pos		               					11                                             
#define TIM_CCMR2_OC4PE_Msk               						(0x01UL << TIM_CCMR2_OC4PE_Pos)  
#define TIM_CCMR2_OC4PE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR2_OC4PE_ENABLE      				       		((uint32_t)0x00000800) 

/** @defgroup TIM_CCMR2_OC4M
  * @{
  */

#define TIM_CCMR2_OC4M_Pos		               					12                                             
#define TIM_CCMR2_OC4M_Msk               							(0x07UL << TIM_CCMR2_OC4M_Pos)  
#define TIM_CCMR2_OC4M_NONE			     				       		((uint32_t)0x00000000)
#define TIM_CCMR2_OC4M_EQH			     				       		((uint32_t)0x00001000)
#define TIM_CCMR2_OC4M_EQL     				        				((uint32_t)0x00002000) 
#define TIM_CCMR2_OC4M_EQTOGGLE  				        			((uint32_t)0x00003000) 
#define TIM_CCMR2_OC4M_FL      			 	        				((uint32_t)0x00004000) 
#define TIM_CCMR2_OC4M_FH 			     				       		((uint32_t)0x00005000)
#define TIM_CCMR2_OC4M_PWM1    				        				((uint32_t)0x00006000) 
#define TIM_CCMR2_OC4M_PWM2		  				        			((uint32_t)0x00007000) 

/** @defgroup TIM_CCMR2_OC4CE
  * @{
  */
#define TIM_CCMR2_OC4CE_Pos		               					15                                             
#define TIM_CCMR2_OC4CE_Msk               						(0x01UL << TIM_CCMR2_OC4CE_Pos)  
#define TIM_CCMR2_OC4CE_DISABLE			     				      ((uint32_t)0x00000000)
#define TIM_CCMR2_OC4CE_ENABLE      				       		((uint32_t)0x00008000) 		

/**
* @}TIM_CCER
*/

/** @defgroup TIM_CCER_CC1E
  * @{
  */
#define TIM_CCER_CC1E_Pos		               						0                                             
#define TIM_CCER_CC1E_Msk               							(0x01UL << TIM_CCER_CC1E_Pos)  
#define TIM_CCER_CC1E_DISABLE    				        			((uint32_t)0x00000000) 
#define TIM_CCER_CC1E_ENABLE     				        			((uint32_t)0x00000001)

/** @defgroup TIM_CCER_CC1P
  * @{
  */
#define TIM_CCER_CC1P_Pos		               						1                                             
#define TIM_CCER_CC1P_Msk               							(0x01UL << TIM_CCER_CC1P_Pos)  
#define TIM_CCER_CC1P_HIGH     				        				((uint32_t)0x00000000)
#define TIM_CCER_CC1P_LOW		    				        			((uint32_t)0x00000002) 

/** @defgroup TIM_CCER_CC1NE
  * @{
  */
#define TIM_CCER_CC1NE_Pos		               					2                                             
#define TIM_CCER_CC1NE_Msk               							(0x01UL << TIM_CCER_CC1NE_Pos)  
#define TIM_CCER_CC1NE_DISABLE    				        		((uint32_t)0x00000000) 
#define TIM_CCER_CC1NE_ENABLE     				        		((uint32_t)0x00000004)

/** @defgroup TIM_CCER_CC1NP
  * @{
  */
#define TIM_CCER_CC1NP_Pos		               					3                                             
#define TIM_CCER_CC1NP_Msk               							(0x01UL << TIM_CCER_CC1NP_Pos)  
#define TIM_CCER_CC1NP_HIGH     				        			((uint32_t)0x00000000)
#define TIM_CCER_CC1NP_LOW		    				        		((uint32_t)0x00000008) 

/** @defgroup TIM_CCER_CC2E
  * @{
  */
	
#define TIM_CCER_CC2E_Pos		               						4                                             
#define TIM_CCER_CC2E_Msk               							(0x01UL << TIM_CCER_CC2E_Pos)  
#define TIM_CCER_CC2E_DISABLE    				        			((uint32_t)0x00000000) 
#define TIM_CCER_CC2E_ENABLE     				        			((uint32_t)0x00000010)

/** @defgroup TIM_CCER_CC2P
  * @{
  */
#define TIM_CCER_CC2P_Pos		               						5                                             
#define TIM_CCER_CC2P_Msk               							(0x01UL << TIM_CCER_CC2P_Pos)  
#define TIM_CCER_CC2P_HIGH     				        				((uint32_t)0x00000000)
#define TIM_CCER_CC2P_LOW		    				        			((uint32_t)0x00000020) 

/** @defgroup TIM_CCER_CC2NE
  * @{
  */
#define TIM_CCER_CC2NE_Pos		               					6                                             
#define TIM_CCER_CC2NE_Msk               							(0x01UL << TIM_CCER_CC2NE_Pos)  
#define TIM_CCER_CC2NE_DISABLE    				        		((uint32_t)0x00000000) 
#define TIM_CCER_CC2NE_ENABLE     				        		((uint32_t)0x00000040)

/** @defgroup TIM_CCER_CC2NP
  * @{
  */
#define TIM_CCER_CC2NP_Pos		               					7                                             
#define TIM_CCER_CC2NP_Msk               							(0x01UL << TIM_CCER_CC2NP_Pos)  
#define TIM_CCER_CC2NP_HIGH     				        				((uint32_t)0x00000000)
#define TIM_CCER_CC2NP_LOW		    				        		((uint32_t)0x00000080) 
         
/** @defgroup TIM_CCER_CC3E
  * @{
  */         
          
#define TIM_CCER_CC3E_Pos		               						8                                             
#define TIM_CCER_CC3E_Msk               							(0x01UL << TIM_CCER_CC3E_Pos)  
#define TIM_CCER_CC3E_DISABLE    				        			((uint32_t)0x00000000) 
#define TIM_CCER_CC3E_ENABLE     				        			((uint32_t)0x00000100)

/** @defgroup TIM_CCER_CC3P
  * @{
  */
#define TIM_CCER_CC3P_Pos		               						9                                             
#define TIM_CCER_CC3P_Msk               							(0x01UL << TIM_CCER_CC3P_Pos)  
#define TIM_CCER_CC3P_HIGH     				        				((uint32_t)0x00000000)
#define TIM_CCER_CC3P_LOW		    				        			((uint32_t)0x00000200) 

/** @defgroup TIM_CCER_CC3NE
  * @{
  */
#define TIM_CCER_CC3NE_Pos		               					10                                             
#define TIM_CCER_CC3NE_Msk               							(0x01UL << TIM_CCER_CC3NE_Pos)  
#define TIM_CCER_CC3NE_DISABLE    				        		((uint32_t)0x00000000) 
#define TIM_CCER_CC3NE_ENABLE     				        		((uint32_t)0x00000400)

/** @defgroup TIM_CCER_CC3NP
  * @{
  */
#define TIM_CCER_CC3NP_Pos		               					11                                             
#define TIM_CCER_CC3NP_Msk               							(0x01UL << TIM_CCER_CC3NP_Pos)  
#define TIM_CCER_CC3NP_HIGH     				        				((uint32_t)0x00000000)
#define TIM_CCER_CC3NP_LOW		    				        		((uint32_t)0x00000800) 

/** @defgroup TIM_CCER_CC4E
  * @{
  */   
#define TIM_CCER_CC4E_Pos		               						12                                             
#define TIM_CCER_CC4E_Msk               							(0x01UL << TIM_CCER_CC4E_Pos)  
#define TIM_CCER_CC4E_DISABLE    				        			((uint32_t)0x00000000) 
#define TIM_CCER_CC4E_ENABLE     				        			((uint32_t)0x00001000)

/** @defgroup TIM_CCER_CC4P
  * @{
  */
#define TIM_CCER_CC4P_Pos		               						13                                             
#define TIM_CCER_CC4P_Msk               							(0x01UL << TIM_CCER_CC4P_Pos)  
#define TIM_CCER_CC4P_HIGH     				        				((uint32_t)0x00000000)
#define TIM_CCER_CC4P_LOW		    				        			((uint32_t)0x00002000) 


/**
* @}TIM_BDTR
*/
/** @defgroup TIM_BDTR_DTG
  * @{
  */
#define TIM_BDTR_DTG_Pos		 			              			0                                             
#define TIM_BDTR_DTG_Msk         				      				(0xFFUL << TIM_BDTR_DTG_Pos)  

/** @defgroup TIM_BDTR_LOCK
  * @{
  */
#define TIM_BDTR_LOCK_Pos		 			              			8                                             
#define TIM_BDTR_LOCK_Msk         				      			(0x03UL << TIM_BDTR_LOCK_Pos)  
#define TIM_BDTR_LOCK_LEVEL0     				      			  ((uint32_t)0x00000000)
#define TIM_BDTR_LOCK_LEVEL1    				     				  ((uint32_t)0x00000100) 
#define TIM_BDTR_LOCK_LEVEL2    				     				  ((uint32_t)0x00000200) 
#define TIM_BDTR_LOCK_LEVEL3    				     				  ((uint32_t)0x00000300) 

/** @defgroup TIM_BDTR_OSSI
  * @{
  */
#define TIM_BDTR_OSSI_Pos		 			              			10                                             
#define TIM_BDTR_OSSI_Msk         				      			(0x01UL << TIM_BDTR_OSSI_Pos)  
#define TIM_BDTR_OSSI_ENABLE	     		      			  	((uint32_t)0x00000400)
#define TIM_BDTR_OSSI_DISABLE    				     				  ((uint32_t)0x00000000) 

/** @defgroup TIM_BDTR_OSSR
  * @{
  */
#define TIM_BDTR_OSSR_Pos		 			              			11                                             
#define TIM_BDTR_OSSR_Msk         				        		(0x01UL << TIM_BDTR_OSSR_Pos)  
#define TIM_BDTR_OSSR_ENABLE	     	 		      			 	((uint32_t)0x00000800)
#define TIM_BDTR_OSSR_DISABLE    				     				 	((uint32_t)0x00000000) 

/** @defgroup TIM_BDTR_BKE
  * @{
  */
#define TIM_BDTR_BKE_Pos		 			              			12                                             
#define TIM_BDTR_BKE_Msk         				      				(0x01UL << TIM_BDTR_BKE_Pos)  
#define TIM_BDTR_BKE_ENABLE     				      			  ((uint32_t)0x00001000)
#define TIM_BDTR_BKE_DISABLE    				     				  ((uint32_t)0x00000000) 

