wyp19960729/FM33L0XX-keil-GCC-/keil project/UserCode/fm33l0xx_tim.h
/** @defgroup TIM_BDTR_BKP
  * @{
  */
#define TIM_BDTR_BKP_Pos		 			              			13                                             
#define TIM_BDTR_BKP_Msk         				      				(0x01UL << TIM_BDTR_BKP_Pos)  
#define TIM_BDTR_BKP_HIGH     				      				  ((uint32_t)0x00002000)
#define TIM_BDTR_BKP_LOW    				     						  ((uint32_t)0x00000000) 

/** @defgroup TIM_BDTR_AOE
  * @{
  */
#define TIM_BDTR_AOE_Pos		 			              			14                                             
#define TIM_BDTR_AOE_Msk         				      				(0x01UL << TIM_BDTR_AOE_Pos)  
#define TIM_BDTR_AOE_SOFTAEVENT				      				  ((uint32_t)0x00004000)
#define TIM_BDTR_AOE_SOFT   				     						  ((uint32_t)0x00000000) 

/** @defgroup TIM_BDTR_MOE
  * @{
  */
#define TIM_BDTR_MOE_Pos		 			              			15                                             
#define TIM_BDTR_MOE_Msk         				      				(0x01UL << TIM_BDTR_MOE_Pos)  
#define TIM_BDTR_MOE_ENABLE     				      			  ((uint32_t)0x00008000)
#define TIM_BDTR_MOE_DISABLE    				     				  ((uint32_t)0x00000000) 

/**
* @}TIM_DCR
*/
/** @defgroup TIM_DCR_DBA
  * @{
  */
#define TIM_DCR_DBA_Pos		 			              			0                                             
#define TIM_DCR_DBA_Msk         				      			(0x1FUL << TIM_DCR_DBA_Pos)  

/** @defgroup TIM_DCR_DBL
  * @{
  */
#define TIM_DCR_DBL_Pos		 			              			8                                             
#define TIM_DCR_DBL_Msk         				      			(0x1FUL << TIM_DCR_DBL_Pos)  


/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/ 
extern void TIM_TimeBaseInit(ATIM_Type* TIMx, TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct);
extern void TIM_Cmd(ATIM_Type* TIMx, FunState NewState);
extern void TIM_OC1Init(ATIM_Type* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct);
extern void TIM_OC2Init(ATIM_Type* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct);
extern void TIM_OC3Init(ATIM_Type* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct);
extern void TIM_OC1PreloadConfig(ATIM_Type* TIMx, uint32_t TIM_OCPreload);
extern void TIM_OC2PreloadConfig(ATIM_Type* TIMx, uint32_t TIM_OCPreload);
extern void TIM_OC3PreloadConfig(ATIM_Type* TIMx, uint32_t TIM_OCPreload);
extern void TIM_ARRPreloadConfig(ATIM_Type* TIMx, FunState NewState);
extern void TIM_BDTRConfig(ATIM_Type* TIMx, TIM_BDTRInitTypeDef *TIM_BDTRInitStruct);
extern void TIM_Cmd(ATIM_Type* TIMx, FunState NewState);
extern void TIM_CtrlPWMOutputs(ATIM_Type* TIMx, FunState NewState);
extern void TIM_CCxCmd(ATIM_Type* TIMx, uint32_t TIM_Channel, uint32_t TIM_CCx);
extern void TIM_CCxNCmd(ATIM_Type* TIMx, uint32_t TIM_Channel, uint32_t TIM_CCxN);
extern void BLDC_ATIM_PWM_Init(void);
extern void TIM_SetCompare1(ATIM_Type* TIMx, uint32_t Compare1);
extern void TIM_SetCompare2(ATIM_Type* TIMx, uint32_t Compare2);
extern void TIM_SetCompare3(ATIM_Type* TIMx, uint32_t Compare3);
extern void TIM_ICInit(ATIM_Type* TIMx, TIM_ICInitTypeDef* TIM_ICInitStruct);
extern void TIM_SelectHallSensor(ATIM_Type* TIMx, FunState NewState);
extern void TIM_SelectInputTrigger(ATIM_Type* TIMx, uint32_t TIM_InputTriggerSource);
extern void TIM_SelectSlaveMode(ATIM_Type* TIMx, uint32_t TIM_SlaveMode);
extern void TIM_SelectMasterSlaveMode(ATIM_Type* TIMx, uint32_t TIM_MasterSlaveMode);
extern void TIM_ITConfig(ATIM_Type* TIMx, uint32_t TIM_IT, FunState NewState);
extern void TIM_ClearITPendingBit(ATIM_Type* TIMx, uint32_t TIM_IT);
extern ITStatus TIM_GetITStatus(ATIM_Type* TIMx, uint32_t TIM_IT);
extern void HALL_TIMx_Init(void);


#ifdef __cplusplus
}
#endif

#endif /* __FM33L0XX_TIM_H */



/************************ (C) COPYRIGHT FMSHelectronics *****END OF FILE****/



